In [73]:
import pandas as pd
import numpy as np
df = pd.read_csv('property_data_small.csv')

In [74]:
print(df.head())

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [75]:
df.loc[:, df.isnull().any()]

           PID  ST_NUM OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0            Y            3        1  1000
1  100002000.0   197.0            N            3      1.5    --
2  100003000.0     NaN            N          NaN        1   850
3  100004000.0   201.0           12            1      NaN   700
4          NaN   203.0            Y            3        2  1600
5  100006000.0   207.0            Y          NaN        1   800
6  100007000.0     NaN          NaN            2   HURLEY   950
7  100008000.0   213.0            Y            1        1   NaN
8  100009000.0   215.0            Y           na        2  1800

In [76]:
print(df.ST_NUM)

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [77]:
print(df['ST_NUM'].isnull())

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [78]:
#NUM_BEDROOMS has funky formatting, and pandas won't recognize these "na"'s
#Try it to prove it...
print(df.NUM_BEDROOMS)
print(df['NUM_BEDROOMS'].isnull())

0      3
1      3
2    NaN
3      1
4      3
5    NaN
6      2
7      1
8     na
Name: NUM_BEDROOMS, dtype: object
0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [79]:
#Obviously missed row 8's "na"

# . So, we can make a list of all the values that mean NaN to Python:

missing_values = ["n/a", "na", "--"]
df = pd.read_csv('property_data_small.csv', na_values = missing_values)

In [80]:
#Now look at the column 'NUM_BEDROOMS':
print(df.NUM_BEDROOMS)
print(df['NUM_BEDROOMS'].isnull())

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64
0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
Name: NUM_BEDROOMS, dtype: bool

In [81]:
# Owner occupied column is a bit weird, because it should be a string of Y, N, or NaN, but there's an integer...

print(df.OWN_OCCUPIED)
print(df.OWN_OCCUPIED.isnull())

0      Y
1      N
2      N
3     12
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object
0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [82]:
# Let's treat this set as if it were a very large set, and there could be other data entered like '12'
# If the value can be changed to an integer, we make it NaN

In [83]:
bad_values = ['12']
df = pd.read_csv("property_data_small.csv", na_values = bad_values)

In [84]:
print(df)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY          NaN            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [85]:
print(df.isnull().sum())

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    2
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
dtype: int64

In [86]:
#Simple test for null values:

print(df.isnull().values.any())

True

In [87]:
# Total missing values:

print(df.isnull().sum().sum())

9

In [88]:
# Now let's say we want to replace NaN values with the median in the 'ST_NUM' column:

median_st_num = df['ST_NUM'].median()
df['ST_NUM'].fillna(median_st_num, inplace=True)
print(df.ST_NUM)

0    104.0
1    197.0
2    203.0
3    201.0
4    203.0
5    207.0
6    203.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64